#!/home/python/n/pyneng/bin/python
# -*- coding: utf-8 -*-
import sys
'''
Задание 5.1a
Всё, как в задании 5.1. Но, если пользователь ввел адрес хоста, а не адрес сети,
то надо адрес хоста преобразовать в адрес сети и вывести адрес сети и маску, как в задании 5.1.
Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16
Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30
Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:
Network:
10        0         1         0
00001010  00000000  00000001  00000000
Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000
Проверить работу скрипта на разных комбинациях сеть/маска.
Ограничение: Все задания надо выполнять используя только пройденные темы.
'''

prefix=input("Enter ip prefix:")
net, s = prefix.split("/")
ip0, ip1, ip2, ip3 = net.split(".")
mask = [0, 0, 0, 0]
for i in range(int(s)):
 mask[int(i/8)] = mask[int(i/8)] + (1 << (7 - i % 8))

print("Network:")
print("{:8>} {:8} {:8} {:8}".format(int(ip0) & int(mask[0]), int(ip1) & int(mask[1]), int(ip2) & int(mask[2]), int(ip3) & int(mask[3])))
print("{:08b} {:08b} {:08b} {:08b}".format(int(ip0) & int(mask[0]), int(ip1) & int(mask[1]), int(ip2) & int(mask[2]), int(ip3) & int(mask[3])))
print("Mask:")
print("/" + s)
print("{:8>} {:8} {:8} {:8}".format(int(mask[0]), int(mask[1]), int(mask[2]), int(mask[3])))
print("{:08b} {:08b} {:08b} {:08b}".format(int(mask[0]), int(mask[1]), int(mask[2]), int(mask[3])))
